app/controllers/api/videos_controller.rb

SELECT "videos".* FROM "videos"
---
    def index
        @videos = Video.all