app/models/user.rb

    def self.find_by_credentials(username, password)
        user = User.find_by(username: username) || User.find_by(email: username)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "isaac3"], ["LIMIT", 1]]

    def reset_session_token!
        self.session_token = SecureRandom.urlsafe_base64
        self.save
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "VJgVgWjLrE53ui6PphOHFQ"], ["updated_at", "2020-04-09 14:10:07.866260"], ["id", 54]]